Tekla.Structures.CatalogInternal.RebarItemEnumerator_t
The RebarItemEnumerator_t structure.

Tekla.Structures.CatalogInternal.RebarItemEnumerator_t.IndexToStart
The index to start from.

Tekla.Structures.CatalogInternal.RebarItemEnumerator_t.RebarItems
The number of rebar items in the enumerator.

Tekla.Structures.CatalogInternal.RebarItemEnumerator_t.Size
The rebar size list.

Tekla.Structures.CatalogInternal.RebarItemEnumerator_t.Grade
The rebar grade list.

Tekla.Structures.CatalogInternal.RebarItemEnumerator_t.Usage
The rebar usage list.

Tekla.Structures.CatalogInternal.RebarItemEnumerator_t.BendRadius
The rebar bend radius list.

Tekla.Structures.CatalogInternal.RebarItemEnumerator_t.Code
The rebar code list.

Tekla.Structures.CatalogInternal.RebarItemEnumerator_t.NominalDiameter
The rebar nominal diameter list.

Tekla.Structures.CatalogInternal.RebarItemEnumerator_t.ActualDiameter
The rebar actual diameter list.

Tekla.Structures.CatalogInternal.RebarItemEnumerator_t.WeightPerLenght
The rebar weight per lenght list.

Tekla.Structures.CatalogInternal.RebarItemEnumerator_t.CrossSectionArea
The rebar cross section area list.

Tekla.Structures.CatalogInternal.RebarItemEnumerator_t.HookRadius90Degrees
The rebar hook radius at 90 degrees list.

Tekla.Structures.CatalogInternal.RebarItemEnumerator_t.HookLength90Degrees
The rebar hook length at 90 degrees list.

Tekla.Structures.CatalogInternal.RebarItemEnumerator_t.HookRadius135Degrees
The rebar hook radius at 135 degrees list.

Tekla.Structures.CatalogInternal.RebarItemEnumerator_t.HookLength135Degrees
The rebar hook length at 135 degrees list.

Tekla.Structures.CatalogInternal.RebarItemEnumerator_t.HookRadius180Degrees
The rebar hook radius at 180 degrees list.

Tekla.Structures.CatalogInternal.RebarItemEnumerator_t.HookLength180Degrees
The rebar hook length at 180 degrees list.

Tekla.Structures.CatalogInternal.RebarItemEnumerator_t.LapLength
The lap length list.

Tekla.Structures.CatalogInternal.RebarItemEnumerator_t.CrankStraightLength
The crank straight length list.

Tekla.Structures.CatalogInternal.RebarItemEnumerator_t.CrankedLengthType
The cranked length type list.

Tekla.Structures.CatalogInternal.RebarItemEnumerator_t.CrankedLength
The cranked length list.

Tekla.Structures.CatalogInternal.RebarItemEnumerator_t.CrankExtraOffset
The crank extra offset list.

Tekla.Structures.CatalogInternal.RebarItemEnumerator_t.HeaderItems
The header items.